% Генерация коэффицентов (импульсной характеристики) для фильтра 
% приподнятого косинуса
%> @file RCcoeff.m
% =========================================================================
%> @brief Генерация коэффицентов (импульсной характеристики)для фильтра 
%>        приподнятого косинуса
%> @param span Длина фильтра в символах (количество боковых лепестков sinc, 
%>                                       сумма с двух сторон)
%> @param nsamp Число выборок на символ
%> @param rolloff Коэффицент сглаживания (alfa)
%> @return coeff Коэффиценты для фильтра корень из приподнятого косинуса
% =========================================================================
function coeff = RCcoeff (span, nsamp, rolloff)
    duration = nsamp*span;
    t = -duration/2 : duration/2;
    t(t == 0) = 1e-12;
    Ts = nsamp; 

    h = (1 / sqrt(Ts)) .* (sin(pi .* t / Ts) ./ (pi .* t / Ts)) .*...
        (cos(pi * rolloff * t / Ts) ./ (1 - (2 * rolloff * t / Ts).^2));

    h(t == 0) = (1 / sqrt(Ts));

    h(abs(t) == int8(Ts / (2*rolloff))) = (1 / sqrt(Ts)) * (rolloff / 2) * ...
                sin(pi / (2*rolloff));

    coeff = h;

end